# Решение первой задачи

print('------------------------------------------------------------------------')

print('Добрового времени суток дорогой пользователь!!\nРады видеть вас в нашем калькуляторе яблок для детей!)')

print('------------------------------------------------------------------------')

quantity_of_apples = int(input('Введите количество яблок:'))

quantity_of_people = int(input('Введите количество детей:'))

print('------------------------------------------------------------------------')

print('Количество яблок что получит каждый ребенок:', quantity_of_apples//quantity_of_people)

print('Количество яблок что останеться в корзине:', quantity_of_apples % quantity_of_people)

print('------------------------------------------------------------------------')

# Решение второй задачи

